fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.BKM_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРабот</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.BKM_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРабот</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если  Не ДатыЗаполненыВерно() Тогда
		 Отказ = Истина;
	 КонецЕсли;
	 
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеНачисления

&НаКлиенте
Асинх Процедура ОсновныеНачисленияВидРасчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеНачисления.ТекущиеДанные;
	Если ТекущиеДанные.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск") 
		И ТекущиеДанные.ГрафикРабот <> ПолучитьГрафикРаботОтпуска() Тогда
		
			Результат = Ждать ВопросАсинх("Установить график работ - ОтпускКалендарныеДни?", 
			РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
			
			Если Результат = КодВозвратаДиалога.Да Тогда				
				ТекущиеДанные.ГрафикРабот = ПолучитьГрафикРаботОтпуска();			
			КонецЕсли; 
			
	КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Заполнить(Команда) 
	
	Если Объект.ОсновныеНачисления.Количество() <> 0 ИЛИ Объект.ДополнительныеНачисления.Количество() <> 0 Тогда
			
		Результат = Ждать ВопросАсинх("Табличные части начислений будут очищены. Продолжить?", 
		РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
		
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда				
			Возврат;			
		КонецЕсли; 
		
	КонецЕсли;
			
	ЗаполнитьНаСервере(); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
		
	Объект.ОсновныеНачисления.Очистить();
	Объект.ДополнительныеНачисления.Очистить();
	Запрос = Новый Запрос;
	Запрос. Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&НачалоПериода,) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|ГДЕ
	|	НЕ ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ВыполненныеСотрудникомРаботы.ЧасовКОплате) КАК ЧасовКОплате,
	|	СУММА(ВКМ_ВыполненныеСотрудникомРаботы.СуммаКОплате) КАК СуммаКОплате
	|ПОМЕСТИТЬ ВТ_Корректировка
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы КАК ВКМ_ВыполненныеСотрудникомРаботы
	|ГДЕ
	|	ВКМ_ВыполненныеСотрудникомРаботы.Регистратор = &Ссылка
	|	И ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник В
	|		(ВЫБРАТЬ
	|			ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТ_Сотрудники КАК ВТ_Сотрудники)
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ГрафикРабот,
	|		ЗНАЧЕНИЕ(Справочник.ВКМ_ГрафикиРабот.ПустаяСсылка)) КАК ГрафикРабот,
	|	ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты.ЧасовКОплатеОборот, 0) +
	|		ЕСТЬNULL(ВТ_Корректировка.ЧасовКОплате, 0) +
	|		ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты.ЧасовКОплатеНачальныйОстаток, 0) КАК НачисленоЧасов,
	|	ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты.СуммаКОплатеОборот, 0) +
	|		ЕСТЬNULL(ВТ_Корректировка.СуммаКОплате, 0) +
	|		ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты.СуммаКОплатеНачальныйОстаток, 0) КАК СуммаНачисления,
	|	&НачалоПериода КАК ДатаНачала,
	|	&КонецПериода КАК ДатаОкончания,
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад) КАК ВидРасчета,
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_Сотрудники КАК ВТ_Сотрудники)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_Сотрудники.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода,,,
	|			Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_Сотрудники КАК ВТ_Сотрудники)) КАК BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты
	|		ПО ВТ_Сотрудники.Сотрудник = BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корректировка КАК ВТ_Корректировка
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_Корректировка.Сотрудник";	
	
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата)); 
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл 
		
		ЗаполнитьЗначенияСвойств(Объект.ОсновныеНачисления.Добавить(), Выборка);
		
		Если Выборка.СуммаНачисления <> 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект.ДополнительныеНачисления.Добавить(), Выборка);
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры


&НаСервере
Функция ПолучитьГрафикРаботОтпуска()

	Возврат Константы.ВКМ_ГрафикОтпуска.Получить();

КонецФункции


&НаКлиенте
Функция ДатыЗаполненыВерно()
	
	Для Каждого СтрокаТЧ Из Объект.ОсновныеНачисления Цикл
		
		Результат = Истина;
		Если   СтрокаТЧ.ДатаНачала > СтрокаТЧ.ДатаОкончания Тогда 
			
			Результат = Ложь;
			ТекстСообщения = "Неправильно заполнены поля ДатаНачала и ДатаОкончани. ДатаНачала больше чем ДатаОкончания";
			//@skip-check unknown-method-property
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновныеНачисления[" + Формат(СтрокаТЧ.НомерСтроки -1 ,"ЧДЦ=0; ЧГ=0")  + " ].ДатаНачала");;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции


#КонецОбласти
